function chaoticAddressReplace(text){
    var dict = {
        "цниимод": /(((с?[нм]и[нм]?)?и|синяя|миит) ?мо[тд]|кинемат( кинемат)?)/,
        "нерис саломеи": /(нереста? а?л[ао]меи|нерисоми)/,
        "джавахарлала неру": /[^\s]{,5}?((з|дж)а(в[оа])?р?ха(рл?|р?л)а[вл]а|харлала) [мн][еи]ру/,
        "новобиккино": /(на ?баб[иe] ?кино|новолюбить ?кино)/,
        "яшьлек": /я[щш]и?л[еы]к/,
        "торайгырова": /(султан ?махму[дт]а? )?(т[оау]райг[иы]р(о|з[еио])ва|2 г[ыи]рова|т[ао]радилова)( султан ?махму[дт]а?)?/,
        "советская": /сем[ьи]градская/,
        "верхненовокутлумбетьево": /(верхнее? ?(нов(о|ый)|молоко)|верхнего) ?(к[оу]н?[зтл]л?|ту[рл])ум?бл?[еи](е|[кт][еь]?е?)в[ао]/,
        "спасоглинищевский": /спасо[бг]лиз?ни?[чщ]евский/,
        "космодамианская набережная": /(набережная )?космодемьянская( набережная)?/,
        "ыбырая алтынсарина": /((а сырая|[ауыэи]б[иы]ра?й?я?|выборгская|[ауыэи]б[иы]?рай?я|[иыэ]рымбая) алты[рн][ст]а(ры)?р?ина|[аыэ]?бара(я|ева) кенсарина)/,
        // "ризаэтдина фахретдина"
        "шугыла бау-бакша cериктестиги": /([сш][иыу]р?г?р?[аиы] ?с?ла? ?|ш[иые]гу)?бао?[оу]м?[- ]?ба([кб]ш|шк)а(си)? ?(с )?(с[еи]р[еи]?к?т?.?[аеиы](т[ие])?[сш]т[еиы]ги?|с[еи]р[еи]?кк?|сергей( сергей?)|с[еи](кр|р[еи]?)инский?|с[еи]р[еи]к.?( *и? ?т[ие]с[иея]ги)?)?/,
        "шарикоподшипниковская": /шарикоподшипников(ое|ск.?.?)/,
        "шораяк омара": /(ш[ао]?р[аое] ?й?[аея]к([тд]ы[нм]?)?|ш[ао]й?[иы]тын|ш[иеэао]р[оа]й?[иыя]к?ц[иы]н) ?([ао]|на)? ([ао]?мар[аыэ]?н?|марве)/,
        "кызылорда": /кызылорда[нл]/,
        "рахимжана кошкарбаева": /(карам? ?)?((ка)?ра[гк]а|р?а?[кх][иы])[мн]ы?д??[жш]ана? к[ао][жш][аие]? ?к[ао]р?ба[еи]ва/,
        "кокшетау": /к[ао]к?ш[еи]к?та[ул]/
        
    }
    _.keys(dict).forEach(function(elem) {
        // $reactions.answer(dict[elem]);
        // $reactions.answer(elem);
        text = text.toLowerCase().replace(dict[elem], elem);
    });
    return text;
}