function chaoticAddressReplace(text){
    var dict = {
        "цниимод": /((с?[нм]и[нм]?)?и ?мо[тд]|кинемат( кинемат)?)/,
        "нерис саломеи": /(нереста? а?л[ао]меи|нерисоми)/,
        "джавахарлала неру": /[^\s]{,5}?((з|дж)а(в[оа])?р?ха(рл?|р?л)а[вл]а|харлала) [мн][еи]ру/,
        "новобиккино": /(на ?баб[иe] ?кино|новолюбить ?кино)/,
        "яшьлек": /я[щш]и?л[еы]к/,
        "торайгырова": /(султан ?махму[дт]а? )?(т[оау]райг[иы]р(о|з[еио])ва|2 г[ыи]рова)( султан ?махму[дт]а?)?/,
        "советская": /сем[ьи]градская/,
        "верхненовокутлумбетьево": /(верхнее? ?(нов(о|ый)|молоко)|верхнего) ?(к[оу]н?[зтл]л?|ту[рл])ум?бл?[еи](е|[кт][еь]?е?)в[ао]/,
        "спасоглинищевский": /спасо[бг]лиз?ни?[чщ]евский/,
        "космодамианская набережная": /(набережная )?космодемьянская( набережная)?/,
        "ыбырая алтынсарина": /((а сырая|[ауыэи]б[иы]ра?й?я?|выборгская|[ауыэи]б[иы]?рай?я|[иыэ]рымбая) алты[рн][ст]а(ры)?р?ина|[аыэ]?бара(я|ева) кенсарина)/,
        // "ризаэтдина фахретдина"
        "шугыла бау-бакша cериктестиги": /(шугыла )?бау[- ]?бакша c[еи]ри?ктестиги/,
        "шарикоподшипниковская": /шарикоподшипников(ое|ск.?.?)/
    }
    _.keys(dict).forEach(function(elem) {
        // $reactions.answer(dict[elem]);
        // $reactions.answer(elem);
        text = text.toLowerCase().replace(dict[elem], elem);
    });
    return text;
}